<template>
  <div class="home-page">
    <!-- <div class="logo"><img alt="logo" src="" /></div> -->
    <div class="task">
      <h1 class="task-title">Задание:</h1>
      <div class="task-text">
        <p>
          Cредствами Vue.js реализуйте примитивное SPA приложение - Книгу
          контактов
        </p>
        <p>Страница 1 - Список контактов</p>
        <p>Страница 2 - Контактная информация выбранного контакта</p>
        <p>Функциональные требования для страницы 1</p>
        <p>- Добавление контакта</p>
        <p>- Удаление контакта (с подтверждением)</p>
        <p>- Переход на контактную информацию контакта</p>
        <p>Функциональные требования для страницы 2</p>
        <p>
          - Добавление полей в виде - "название : значение" (прим.
          E-mail:test@test.com)
        </p>
        <p>- Удаление полей (с подтверждением)</p>
        <p>
          - Редактирование полей с возможностью отмены (отмена с подтвердением)
        </p>
        <p>- Отмена последнего внесенного изменения "Шаг назад"</p>
        <p>Технические требования:</p>
        <p>
          - В качестве языка разработки допускается использовать JavaScript или
          TypeScript
        </p>
        <p>- В качестве сборщика, если это необходимо, используйте Webpack.</p>
        <p>
          - Верстка должна быть выполнена без использования UI библиотек
          (например Vuetify).
        </p>
        <p>Требования к коду:</p>
        <p>
          - Код должен быть написан понятно и аккуратно, с соблюдением табуляции
          и прочих элементов написания, без лишних элементов и функций, не
          имеющих отношения к функционалу тестового задания, снабжен понятными
          комментариями.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "HomePage",
};
</script>

<style lang="scss">
.home-page {
  // pass
}

.logo {
  display: flex;
  justify-content: center;
}
</style>  